[
 {
    "id": 1,
    "title": "Contact Details and Executive Summary",
    "text": "TIJU ABRAHAM\nPhone/Email: Available Upon Request\nLinkedIn: www.linkedin.com/in/tijuabraham\nLocation: Bellevue, Washington, USA\n\nSoftware Delivery & Product Implementation Leader | 12+ Years of Leadership Experience | AI-Enabled Business Automation | PMP, CSM, AZ-900 | SaaS, Cloud, AI/ML | PCI, GDPR, HIPAA | 6 Years of Experience in US | multi-Domain Knowledge"
  },
  {
  "id": 2,
  "title": "Leadership and Execution Experience",
  "text": "Leadership:\n- Executive & Senior Stakeholder Engagement; Global Cross-Functional Team Leadership (40+ members)\n- Product Portfolio Ownership of $10 M+ & P&L Accountability; Strategic Planning & Business-IT Alignment\n- AI Adoption Leadership & Innovation Advocacy\n\nExecution:\n- Delivered $6M+ AI-enabled SaaS, Cloud (Azure/Hybrid), and AI-Driven Solutions\n- Agile, Waterfall & Hybrid Delivery; Full Product Lifecycle Implementation\n- Cloud Modernization, Application Rationalization, and Governance (PCI, GDPR, HIPAA) Compliance\n\nInfluence:\n- Executive-Level Reporting & Insight-Driven Communication\n- Customer-Centric Delivery & Continuous Improvement\n- Data-Driven Decision Making, Change Advocacy & Cultural Enablement\n- Intelligent Automation, KPI/SLA Oversight & Operational Excellence"
},
{
  "id": 3,
  "title": "Accomplishments and Skills Overview",
  "text": "Accomplishments:\n- Achieved 50-60% operational cost savings for 10+ customers via AI-driven process automation.\n- Delivered $150 M/year savings through rationalizing 4,000-app telecom landscape.\n- Led AI automation in banking/finance, insurance claims, document processing, infrastructure monitoring.\n- Migrated 14-year-old SaaS hotel booking product (7K TPS, 200+ customers) to AWS Cloud.\n- Directed AI platform migration from Azure India to East US across three clusters.\n- Established SaaS risk detection framework for reuse, governance, and cost savings.\n\nSkills Overview:\n- Expert in AI modernization, multi-cloud strategy (AWS/Azure), and multi-million-dollar P&L management for large-scale IT delivery.\n- Generative AI, Predictive AI, LLM solutions, application rationalization automation.\n- Cross-cultural leadership with 95%+ CSAT through strategic stakeholder engagement.\n- Built and mentored high-performing product teams; align technology strategy with business goals.\n- Rapid adopter of emerging tech with strong innovation mindset; including RPA and end-to-end automation.\n- Entrepreneurial mindset in presales and solution design."
},
  {
  "id": 4,
  "title": "Industry and Technology Expertise",
  "text": "Industries:\n- Healthcare Insurance, Public Sector, Banking, Finance, Retail, Telecom, Travel & Hospitality, GIS\n\nAutomation & AI:\n- UiPath, Power Automate, Automation Anywhere, Azure AI, Computer Vision\n\nMonitoring & BI:\n- ELK, Grafana, Splunk, Power BI, UML, Figma\n\nEnterprise Platforms:\n- SAP, Oracle EBS, PeopleSoft, QAD, TOLAS, Ariba, Flexera, Salesforce, SharePoint\n\nITSM & Containers:\n- ServiceNow, Freshservice, Docker, Kubernetes\n\nProject Management:\n- Jira, Trello, Aha, MS Project, Azure DevOps, MS Teams, Confluence\n\nProgramming:\n- .NET, Java, Python, JavaScript, PowerShell, C#, ASP.NET, IoT, Kotlin (Android), Swift (iOS)\n\nDevOps & Testing:\n- GitHub, GitLab, Jenkins, SonarQube, Postman, JMeter, Veracode, Selenium, Appium\n\nIntegration:\n- WebSphere, BizTalk, Active Directory, SFTP/FTPS, MSMQ, Rule Engine, Web Services, ETL\n\nDomain Systems:\n- GDS, OTA, Booking Engines, Facets, Amisys, ClaimsXten, Fraud Detection, POS, Loyalty, ESRI"
},
  {
  "id": 5,
  "title": "Professional Experience and Employment History",
  "text": "Roles Managed:\n- Product Implementation Manager, Program Manager, Scrum Master, Cloud Migration Lead, Technical Lead, Release Manager, Data Migration Lead, Delivery Manager\n\nEmployment Highlights:\n- Leading a 40+ member team for a US Tier-1 telco, overseeing flagship mobile apps of 23 million monthly active users and API Gateway processing 3 billion daily transactions.\n- Led AI/ML, RPA, and Application Rationalization platform implementations, enabling automation in document processing, IT service desks, infrastructure monitoring, healthcare claims, banking, and fraud detection.\n- Delivered scalable SaaS/PaaS booking, aggregation, and CRM platforms in travel and hospitality.\n- Executed complex cloud migrations and integrated process automation for Criminal Records, GIS, MVD, and reservation platforms.\n\nWork Experience History:\n- Product Implementation Manager, UST (Nov/2019 - Present)\n- Senior Project Manager, IBS Software (Dec/2013 - Nov/2019)\n- Project Manager, NTT Data (Mar/2007 - Nov/2013)\n- Software Engineer, IBS Software (Jul/2005 - Mar/2007)\n- Software Engineer, Nest IT (Oct/2004 - Jun/2005)\n- Software Programmer, Corpcan Technologies (Oct/2003 - Sep/2004)"
},
  {
  "id": 6,
  "title": "Key Contributions and Integration Experience",
  "text": "Key Contributions:\n- Improved EBITDA and delivery speed by integrating LLMs into the developer/support lifecycle while maintaining 99.99% system availability.\n- Provided both engagement and technical leadership for global AI platform implementations.\n- Automated application rationalization, cutting time, errors, and costs for a 4,000+ application portfolio.\n- Converted business needs into SoWs, winning outcome-based, T&M, and fixed-fee deals.\n- Interfaced with customer leadership to shape roadmaps, PoCs, and long-term partnerships.\n- Owned end-to-end product delivery—from discovery to hypercare—for Cloud/SaaS solutions.\n- Successfully improved customer revenue and reduced operational costs through innovation.\n- Defined migration strategies for legacy-to-cloud transformation with DR/BCP planning.\n- Led cross-functional teams (40+ resources) across onshore/offshore models.\n- Collaborated with Legal, Sales, and Sourcing teams to close large contracts.\n- Delivered effective UAT, change management, and customer onboarding programs.\n- Created detailed project plans, RAID logs, and tracked OKRs for delivery teams.\n- Supported global RFP responses and drove pre-sales and solutioning efforts.\n- Translated high-level ideas into BRDs, technical designs, and architectural models.\n- Managed escalations and served as a liaison between IT, business, and leadership teams.\n\nIntegration Experience:\n- ERP & Enterprise Systems: QAD, TOLAS, Oracle EBS, PeopleSoft, SAP, Salesforce, Flexera, Ariba\n- Cloud & SaaS Platforms: ServiceNow, Robotic Process Automation (UiPath, Power Automate, Automation Anywhere), OCR, Chatbots\n- Monitoring & ITSM Tools: SolarWinds, LogicMonitor, Dynatrace, New Relic, Datadog, AppDynamics, Everest, ICINGA, Freshservice, ITSM\n- Middleware & Integration: WebSphere, BizTalk, Active Directory, SFTP/FTPS, Rule Engine\n- Networking & Security: WAF, SDWAN, Credit Card Tokenization, Power MHS\n- Payment & Transaction Systems: Payment Gateway, MSMQ, Claim Adjudication (ClaimsXten), Healthcare Insurance Fraud Detection, Facets, Amisys\n- Travel & Booking Systems: GDS (Galileo, Sabre, Worldspan, Amadeus), OTA, Internet Booking Engine, Loyalty Management System\n- Development & Middleware: .NET, Java, Python, JavaScript, Kubernetes, PowerShell, IoT\n- GIS & Domain-Specific Systems: ESRI GIS, Property Management System, Point of Sale (POS), Dealer Management System (DMS)\n- Vendor & Web Services: External vendor web services\n- ServiceNow Modules: ITSM, SAM, Enterprise Architecture (APM)"
}  
]

